zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_PCI_HDR_TYPE0.h
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK (0xF800U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT (11U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_WIDTH (5U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CTL_STAT - PCI PCI-PM control and status register */
/*! @{ */

#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK (0x3U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT (0U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_WIDTH (2U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE(x) (((uint16_t)(((uint16_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK (0x8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT (3U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_WIDTH (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST(x) (((uint16_t)(((uint16_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK)
/*! @} */

/*! @name PCI_CFC_EA_CAP_LIST - PCI EA capabilities list register */
/*! @{ */

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_MASK (0xFFU)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_SHIFT (0U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_WIDTH (8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_WIDTH (8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_EA_CAP - PCI EA capabilities register */
/*! @{ */

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_MASK (0x3FU)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_SHIFT (0U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_WIDTH (6U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES(x) (((uint16_t)(((uint16_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_FMT - PCI EA per-entry 0 format register..PCI EA per-entry 1 format register */
/*! @{ */

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_MASK (0x7U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_SHIFT (0U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_WIDTH (3U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_MASK (0xF0U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_SHIFT (4U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_WIDTH (4U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_MASK (0xFF00U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_SHIFT (8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_WIDTH (8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_MASK (0xFF0000U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_SHIFT (16U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_WIDTH (8U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_MASK (0x40000000U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_SHIFT (30U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_WIDTH (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_MASK (0x80000000U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_SHIFT (31U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_WIDTH (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_BASE - PCI EA per-entry 0 base register..PCI EA per-entry 1 base register */
/*! @{ */

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_MASK (0x2U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_SHIFT (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_WIDTH (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_MASK (0xFFFFFFFCU)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_SHIFT (2U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_WIDTH (30U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_MAXOFF - PCI EA per-entry 0 max offset register..PCI EA per-entry 1 max offset register */
/*! @{ */

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_MASK (0x2U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_SHIFT (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_WIDTH (1U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_MASK)

#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_MASK (0xFFFFFFFCU)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_SHIFT (2U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_WIDTH (30U)
#define SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_SHIFT)) & SW_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_MASK)
/*! @} */

